class CreateLog{
  constructor(Version, Date, DescripsionArray) {
    this.Version = Version;
    this.Date = Date;
    this.Description =
      DescripsionArray.
        reduce((Result, Text) => Result + (Result !== "" ? "\n" : "") + Text, "");
  }
}

export const  Result = {
  1: new CreateLog("1.0.0", "2022/11/9", ["正式公開"]),
  2: new CreateLog("1.0.1", "2022/11/26", [
    "共有コードの再発行不可時間短縮",
    "セーブ対象に攻撃スキル/敵情報のカスタム項目を追加",
    "装備品追加"]),
  3: new CreateLog("1.1.0","2022/12/7",["『装備品のカスタム入力』機能追加"]),
  4: new CreateLog("1.2.0","2022/12/12",["ダメージ表示項目オプションに『期待値』を追加"]),
  5: new CreateLog("1.2.1", "2022/12/15", [
    "『期待値』不具合修正",
    "・平均安定率が、確定クリ率と連動してしまっていた部分の修正"]),
  6: new CreateLog("1.3.0", "2022/12/18", [
    "杖/魔道具の追加特性追加",
    "・スキルに属性が入る場合に、(INT/10)%の魔法属性威力上昇",
    "・スキルが無属性の場合に、魔法クリティカル率を25%→50%に緩和(杖のみ)",
    "威力オプションの『属性威力』に項目追加",
    "バフスキル追加",
    "『ステータス確認』に属性有利確認欄を追加"]),
  7: new CreateLog("1.3.1", "2022/12/19", [
    "属性攻撃威力の参照不良修正",
    "スタビリスの反映量修正",
    "スキル『忍道』の追加",
    "・サブ装備:巻物時の両手持ち特性(忍道)の追加"]),
  8: new CreateLog("1.4.0", "2022/12/31", [
    "『敵情報のカスタム入力』機能を追加",
    "バフスキルの追加",
    "重量/軽量化時のASPDの反映量修正",
    "アイテム選択時『なし』が選択できない部分の修正"]),
  9: new CreateLog("1.5.0","2023/1/9",["バフスキルにスキル説明機能を追加"]),
  10: new CreateLog("1.5.1", "2023/2/7", [
    "サンプルデータのレベルを260に更新",
    "一部攻撃スキルのバリエーション項目を追加",
    "貫通威力が100%以上適用されていた部分の修正",
    "状態異常:破壊が反映されていなかった部分の修正",
    "拳スキルの表示不良修正"]),
  11: new CreateLog("1.6.0", "2023/2/21", [
    "一部攻撃スキルに必中属性追加",
    "物理/魔法混同時の計算方法調整",
    "攻撃スキルに溜め可変スキルを追加",
    "・クロスファイア",
    "・天竜乱星/斬納",
    "・ドラゴニックチャージ",
    "・マジックカノン",
    "・ツインバスターブレード",
    "・ソウルハント",
    "攻撃スキル『カスタム入力』の遠距離威力、ロングレンジ適用不良修正",
    "クロスファイアの2段目の固定値/貫通修正※純弓に貫通適用していた部分の削除"]),
  12: new CreateLog("1.7.0", "2023/2/23", [
    "クリスタ:シカノカーミ追加",
    "アドマジのバリエーション追加",
    "『ダークモード』の追加"]),
  13: new CreateLog("1.8.0", "2023/3/15", ["攻撃スキルに『コンボ構成』機能追加"]),
  14: new CreateLog("1.8.1", "2023/3/16", [
    "パッシブ/ブレイブ倍率の自由入力追加※セーブ対象外機能",
    "クリスタ:マギレフィーシア追加",
    "コンボ構成、コンボモード選択時の操作不能解消",
  ]),
  15: new CreateLog("1.8.2", "2023/3/24", [
    "クリスタ：ドラケオル追加",
    "追加装備：シュメッタヘイピン追加"
  ]),
  16: new CreateLog("1.8.3", "2023/3/28", [
    "一部スクロール不良解消"
  ]),
  17: new CreateLog("1.8.4", "2023/4/7", [
    "サーバーセーブ機能不具合修正"
  ]),
  18: new CreateLog("1.8.5", "2023/4/13", [
    "パレットモード2種追加",
    "シールドキャンの威力不具合修正",
    "サンプルデータLvを265に更新",
    "サイトメニューにリンク項目を追加"
  ]),
}